---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.WarnLastType1
source: html/33cfe2aa-8b28-6796-666c-6817569660a3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.WarnLastType1 Property

Last type in system family '[Name]' cannot be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId WarnLastType1 { get; }
```